dependencies/OpenFOAM/tutorials/multiphase/icoReactingMultiphaseInterFoam/inertMultiphaseMultiComponent/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 100 1) simpleGrading (1 1 1)
);


boundary
(
    bottom
    {
        type    wall;
        faces
        (
            (1 5 4 0)
        );
    }
    top
    {
        type    patch;
        faces
        (
            (3 7 6 2)
        );
    }
    left
    {
        type    wall;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type    wall;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type    empty;
        faces
        (
            (4 5 6 7)
            (0 1 2 3)
        );
    }
);


// ************************************************************************* //
